       01 dfhcommarea.
          03 lk-cep               pic  x(008).
          03 lk-uf                PIC  X(002).
          03 lk-cidade            PIC  X(030).
          03 lk-bairro            PIC  X(030).
          03 lk-logradouro        PIC  X(030).