       01 DFHCOMMAREA.     ZZ
          03 LK-CEP               PIC  X(008).
          03 LK-UF                PIC  X(002).
          03 LK-CIDADE            PIC  X(030).
          03 LK-BAIRRO            PIC  X(030).
          03 LK-LOGRADOURO        PIC  X(030).