       01 DFHCOMMAREA.
          03 CEP               PIC  X(008).
          03 UF                PIC  X(002).
          03 CIDADE            PIC  X(030).
          03 BAIRRO            PIC  X(030).
          03 LOGRADOURO        PIC  X(030).