       CBL CICS('COBOL3') APOST
      *-------------------------------------------------------------  *
      *
      *  Module Name = ZCEETST1
      * ----------------------------------
      *
      *  By Valter Siqueira, IBM Brazil.
      *     valters@br.ibm.com
      *-------------------------------------------------------------  *
       IDENTIFICATION DIVISION.
       PROGRAM-ID. ZCEETST1.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *----------------------------------------------------------------*
      * Work area                                                     *
      *----------------------------------------------------------------*
        01 WK-WORK.
           03 WK-RECEIVE-LENGTH        PIC S9(4) COMP VALUE 255.
           03 WK-RECEIVE.
              05 FILLER                PIC X(0004).
              05 WK-RECV-BIN           PIC X(0006).
              05 FILLER                PIC X(0246).
           03 WK-SEND-1.
              05 WK-SEND-BIN-CODE      PIC X(0006) VALUE SPACES.
              05 FILLER                PIC X(0001) VALUE SPACES.
              05 WK-SEND-BIN-DATA      PIC X(0073) VALUE SPACES.
              05 FILLER                PIC X(0080) VALUE ALL '-'.
              05 FILLER                PIC X(0037) VALUE ALL '-'.
              05 FILLER                PIC X(0001) VALUE SPACES.
              05 WK-STATUS-CODE        PIC 9(0004) VALUE ZEROES .
              05 FILLER                PIC X(0001) VALUE SPACES.
              05 FILLER                PIC X(0037) VALUE ALL '-'.
              05 FILLER                PIC X(0080) VALUE ALL '-'.
              05 WK-MESSAGE            PIC X(1024) VALUE SPACES.

      *---------------------------------------------------------------
      * insert the structure language from API/Service generated by
      * 'zconbt' utility after " 01 API-INFO
      *
      * CAUTION: the API information content are case sensitive if you
      *          modify the API may be not found on execution time
      *
      * Standard name "APIxxIxx"
      *---------------------------------------------------------------

       01 API-INFO.
           03 BAQ-APINAME                PIC X(255)
              VALUE 'Caixaapibin_1.0.0'.
           03 BAQ-APINAME-LEN            PIC S9(9) COMP-5 SYNC
              VALUE 17.
           03 BAQ-APIPATH                PIC X(255)
              VALUE '%2FCaixaapibin%2Fbin'.
           03 BAQ-APIPATH-LEN            PIC S9(9) COMP-5 SYNC
              VALUE 20.
           03 BAQ-APIMETHOD              PIC X(255)
              VALUE 'POST'.
           03 BAQ-APIMETHOD-LEN          PIC S9(9) COMP-5 SYNC
              VALUE 4.

      *---------------------------------------------------------------
      * inster the structure language from API/Service generated by
      * 'zconbt' utility after " 01 REQUEST
      * Nome padrao gerado "APIxxQxx"
      *---------------------------------------------------------------

       01 REQUEST.
             06 REQBODY.

               09 CAIXABINQ2-NUM                PIC S9(9) COMP-5 SYNC.

               09 CAIXABINQ.

                 12 BINCODEQ-NUM                  PIC S9(9) COMP-5
            SYNC.

                 12 BINCODEQ.
                   15 BINCODEQ2-LENGTH              PIC S9999 COMP-5
            SYNC.
                   15 BINCODEQ2                     PIC X(6).
      *---------------------------------------------------------------
      * Inserir o Book de "response" da API gerado pelo utilitario
      * 'zconbt' abaixo do nivel "01 RESPONSE"
      * Nome padrao gerado "APIxxPxx"
      *---------------------------------------------------------------

       01 RESPONSE.
             06 RESPBODY.

               09 CAIXABINP2-NUM                PIC S9(9) COMP-5 SYNC.

               09 CAIXABINP.

                 12 BINCODEP-NUM                  PIC S9(9) COMP-5
            SYNC.

                 12 BINCODEP.
                   15 BINCODEP2-LENGTH              PIC S9999 COMP-5
            SYNC.
                   15 BINCODEP2                     PIC X(6).

                 12 BINDATAP-NUM                  PIC S9(9) COMP-5
            SYNC.

                 12 BINDATAP.
                   15 BINDATAP2-LENGTH              PIC S9999 COMP-5
            SYNC.
                   15 BINDATAP2                     PIC X(94).
      *--------------------------------------------------------------
      * Estructure language for STUB comunication execution
      *
      * CAUTION: values and lengths are STUB standards and should not
      *          been modified.
      * Note: The best practice is keep the these Language Structures
      *       in a copybook library.
      *
      *--------------------------------------------------------------
       01  BAQ-REQUEST-INFO.
         03 BAQ-REQUEST-INFO-COMP-LEVEL  PIC S9(9) COMP-5 SYNC VALUE 2.
         03 BAQ-REQUEST-INFO-USER.
            05 BAQ-OAUTH.
               07 BAQ-OAUTH-USERNAME           PIC X(256).
               07 BAQ-OAUTH-USERNAME-LEN       PIC S9(9) COMP-5 SYNC
                                                 VALUE 0.
               07 BAQ-OAUTH-PASSWORD           PIC X(256).
               07 BAQ-OAUTH-PASSWORD-LEN       PIC S9(9) COMP-5 SYNC
                                                 VALUE 0.
               07 BAQ-OAUTH-CLIENTID           PIC X(256).
               07 BAQ-OAUTH-CLIENTID-LEN       PIC S9(9) COMP-5 SYNC
                                                 VALUE 0.
               07 BAQ-OAUTH-CLIENT-SECRET      PIC X(256).
               07 BAQ-OAUTH-CLIENT-SECRET-LEN  PIC S9(9) COMP-5 SYNC
                                                 VALUE 0.
               07 BAQ-OAUTH-SCOPE-PTR          USAGE POINTER.
               07 BAQ-OAUTH-SCOPE-LEN          PIC S9(9) COMP-5 SYNC
                                                 VALUE 0.
            05 BAQ-AUTHTOKEN.
               07 BAQ-TOKEN-USERNAME           PIC X(256).
               07 BAQ-TOKEN-USERNAME-LEN       PIC S9(9) COMP-5 SYNC
                                                 VALUE 0.
               07 BAQ-TOKEN-PASSWORD           PIC X(256).
               07 BAQ-TOKEN-PASSWORD-LEN       PIC S9(9) COMP-5 SYNC
                                                 VALUE 0.
       01  BAQ-RESPONSE-INFO.
         03 BAQ-RESPONSE-INFO-COMP-LEVEL PIC S9(9) COMP-5 SYNC VALUE 0.
         03 BAQ-STUB-NAME                PIC X(8).
         03 BAQ-RETURN-CODE              PIC S9(9) COMP-5 SYNC.
            88 BAQ-SUCCESS                 VALUE 0.
            88 BAQ-ERROR-IN-API            VALUE 1.
            88 BAQ-ERROR-IN-ZCEE           VALUE 2.
            88 BAQ-ERROR-IN-STUB           VALUE 3.
         03 BAQ-STATUS-CODE              PIC S9(9) COMP-5 SYNC.
         03 BAQ-STATUS-MESSAGE           PIC X(1024).
         03 BAQ-STATUS-MESSAGE-LEN       PIC S9(9) COMP-5 SYNC.

      *----------------------------------------------------------------*
      *  Work definitions for CALL communcation STUBE
      *----------------------------------------------------------------*

       01 BAQ-REQUEST-PTR USAGE POINTER.
       01 BAQ-REQUEST-LEN PIC S9(9) COMP-5 SYNC.
       01 BAQ-RESPONSE-PTR USAGE POINTER.
       01 BAQ-RESPONSE-LEN PIC S9(9) COMP-5 SYNC.
       77 COMM-STUB-PGM-NAME PIC X(8) VALUE 'BAQCSTUB'.

      *----------------------------------------------------------------*
      *    L I N K A G E   S E C T I O N
      *----------------------------------------------------------------*

       LINKAGE SECTION.
       01 DFHCOMMAREA             PIC X(100) VALUE SPACES.

      *----------------------------------------------------------------*
      *p r o c e d u r e s
      *----------------------------------------------------------------*

       PROCEDURE DIVISION.

      *----------------------------------------------------------------*
       MAINLINE SECTION.
      *----------------------------------------------------------------*
           INITIALIZE REQUEST
           INITIALIZE RESPONSE

           EXEC CICS RECEIVE INTO   (WK-RECEIVE)
                             LENGTH (WK-RECEIVE-LENGTH)
           END-EXEC

           MOVE LENGTH OF BINCODEQ2 TO BINCODEQ2-LENGTH
           MOVE WK-RECV-BIN         TO BINCODEQ2

           SET BAQ-REQUEST-PTR TO ADDRESS OF REQUEST.
           MOVE LENGTH OF REQUEST TO BAQ-REQUEST-LEN.
           SET BAQ-RESPONSE-PTR TO ADDRESS OF RESPONSE.
           MOVE LENGTH OF RESPONSE TO BAQ-RESPONSE-LEN.

           CALL COMM-STUB-PGM-NAME USING
           BY REFERENCE API-INFO
           BY REFERENCE BAQ-REQUEST-INFO
           BY REFERENCE BAQ-REQUEST-PTR
           BY REFERENCE BAQ-REQUEST-LEN
           BY REFERENCE BAQ-RESPONSE-INFO
           BY REFERENCE BAQ-RESPONSE-PTR
           BY REFERENCE BAQ-RESPONSE-LEN.

           MOVE BINCODEP2             TO WK-SEND-BIN-CODE
           MOVE BINDATAP2             TO WK-SEND-BIN-DATA

           MOVE BAQ-STATUS-MESSAGE    TO WK-MESSAGE
           MOVE BAQ-STATUS-CODE       TO WK-STATUS-CODE

           IF WK-STATUS-CODE = 200
              PERFORM STATUS-CODE-MESSAGE
           END-IF

           EXEC CICS SEND
                     FROM(WK-SEND-1)
                     ERASE
                     LENGTH(LENGTH OF WK-SEND-1)
           END-EXEC

           EXEC CICS RETURN
           END-EXEC
           .
       STATUS-CODE-MESSAGE.
           MOVE 'Funcionou ... faltava indicar os campos preenchidos'
                TO WK-MESSAGE
           .